In [2]:
import numpy as np
import pandas as pd
import seaborn as sns 
import matplotlib.pyplot as plt

%matplotlib inline

In [3]:
df_event = pd.read_csv('./data/events.csv')
df_iata = pd.read_csv('./data/iata.csv')

In [4]:
df_event.shape, df_iata.shape

((47007, 9), (500, 3))

In [5]:
df_event.head(4)

,ts,event_type,user_id,date_from,date_to,origin,destination,num_adults,num_children
0,2017-04-27 11:06:51,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
1,2017-04-27 20:15:27,book,e5d69e,2017-08-12,2017-09-02,FRA,WAS,3,1
2,2017-04-27 23:03:43,book,f953f0,2017-10-08,2017-10-11,BER,CGN,2,0
3,2017-04-27 15:17:50,book,794d35,2017-04-28,2017-05-01,BER,BCN,1,0

In [6]:
df_iata.head(3)

  iata_code    lat    lon
0       LON  51.50  -0.17
1       MOW  55.75  37.70
2       NYC  40.71 -74.01

In [7]:
origin = set(df_event['origin'].unique())
iata_code = set(df_iata['iata_code'].unique())

In [8]:
len(iata_code), len(origin)

(298, 236)

In [9]:
len(iata_code.intersection(origin))

236

In [10]:
df_event['event_type'].value_counts()

search    45198
book       1809
Name: event_type, dtype: int64

In [11]:
len(df_event['user_id'].unique())

31179

In [12]:
len(df_event[df_event['event_type']=='book']['user_id'].unique())

1805

In [13]:
booked_user_id = df_event[df_event['event_type']=='book']['user_id'].unique()

In [14]:
np.sum(df_event['user_id'].isin(booked_user_id))

9490

In [15]:
df_event_booked = df_event[df_event['user_id'].isin(booked_user_id)]
df_event_booked.head(2)

,ts,event_type,user_id,date_from,date_to,origin,destination,num_adults,num_children
0,2017-04-27 11:06:51,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
1,2017-04-27 20:15:27,book,e5d69e,2017-08-12,2017-09-02,FRA,WAS,3,1

In [16]:
df_event_booked.shape

(9490, 9)

In [17]:
df_event_searched= df_event[(df_event['user_id'].isin(booked_user_id)==False)]
print (df_event_searched.shape)
df_event_searched.head(2)

(37517, 9)

,ts,event_type,user_id,date_from,date_to,origin,destination,num_adults,num_children
27,2017-04-29 00:24:16,search,dea471,2017-05-05,2017-05-05,MOW,STR,1,0
34,2017-04-27 22:39:53,search,6600e0,2017-10-05,2017-10-20,FRA,IST,2,0

In [18]:
len(df_event_booked[df_event_booked['event_type']=='search']['user_id'].unique())

1782

In [19]:
len(df_event_booked[df_event_booked['event_type']=='book']['user_id'].unique())

1805

In [20]:
only_booked_user = set(df_event_booked[df_event_booked['event_type']=='book']['user_id'].unique()) - set(df_event_booked[df_event_booked['event_type']=='search']['user_id'].unique())

In [21]:
len(only_booked_user)

23

In [22]:
df_event[df_event['user_id'].isin(only_booked_user)]

,ts,event_type,user_id,date_from,date_to,origin,destination,num_adults,num_children
229,2017-04-28 21:59:05,book,bbb63d,2017-09-21,2017-10-05,PAR,VCE,6,0
1523,2017-04-21 22:51:27,book,3a5cd2,2017-06-15,2017-06-22,FRA,TCI,2,0
1688,2017-04-22 22:24:02,book,2fd409,2017-04-23,2017-04-23,MUC,TXL,1,0
1811,2017-04-21 16:04:28,book,bdd35d,2017-06-04,2017-06-12,CMN,IST,2,0
1949,2017-04-26 17:09:48,book,63a3be,2017-05-02,2017-05-04,HAM,CGN,1,0
2091,2017-04-26 20:31:15,book,4ba5fe,2017-05-02,2017-05-16,FRA,ALG,1,0
2948,2017-04-21 19:33:02,book,4cdc59,2017-06-30,2017-07-05,TLS,OPO,2,0
3467,2017-04-19 02:44:33,book,5f5211,2017-04-25,2017-05-04,PAR,CPH,1,0
4385,2017-04-19 16:58:03,book,064440,2017-05-28,2017-06-05,DUS,LAS,1,0
4728,2017-04-20 23:35:13,book,9b75e1,2017-05-17,2017-05-26,VIE,FRA,1,0
4803,2017-04-25 19:30:53,book,1ff89a,2017-05-14,2017-05-14,MUC,MXP,1,0
4976,2017-04-20 16:55:40,book,f76889,2017-06-12,2017-06-15,BER,LON,1,0
5110,2017-04-20 23:40:56,book,850537,2017-07-23,2017-07-23,PAR,VCE,2,0
5810,2017-04-24 00:50:59,book,147ffe,2017-05-16,2017-05-21,DUS,VIE,1,0
5981,2017-04-24 20:48:35,book,c63f69,2018-01-11,2018-01-18,FRA,TCI,2,0
6916,2017-04-29 19:52:55,book,fa5974,2017-05-01,2017-05-02,OPO,FRA,1,0
7082,2017-04-28 02:28:29,book,99dc14,2017-12-24,2017-12-24,NYC,HAV,2,0
7824,2017-04-25 09:48:32,book,c55b0f,2017-06-26,2017-07-10,FRA,SGN,2,0
8685,2017-04-27 20:00:41,book,d979e0,2017-05-15,2017-05-26,BER,AGP,2,2
9635,2017-04-28 00:02:21,book,c06a18,2017-07-04,2017-07-08,BER,PMI,2,0
38409,2017-05-02 01:13:20,book,4c171b,2017-05-12,2017-05-12,SAW,DUS,2,0
44522,2017-04-30 16:43:12,book,60fdad,2017-05-02,2017-05-22,AUH,PAR,1,0
46722,2017-04-25 00:42:28,book,f665fb,2017-04-25,2017-04-25,AGP,BER,1,0

In [23]:
df_event.groupby('user_id').size().reset_index()

      user_id  0
0      000069  1
1      00019d  1
2      0002e3  1
3      000332  4
4      0004e1  2
...       ... ..
31174  fff74a  1
31175  fff86d  1
31176  fff8fc  1
31177  fff95a  1
31178  fffcb9  1

[31179 rows x 2 columns]

In [24]:
df_event['destination'].value_counts()[:10]

PMI    2110
IST    1762
LIS    1607
BCN    1513
BER    1468
PAR    1197
BKK    1191
LON    1101
OPO    1001
MUC     966
Name: destination, dtype: int64

In [25]:
df_event['origin'].value_counts()[:10]

PAR    6010
FRA    5813
MUC    4638
DUS    4470
HAM    3699
BER    3501
STR    2684
CGN    2197
LYS    1560
CDG    1306
Name: origin, dtype: int64

In [27]:
df_event[df_event['user_id']=='60225f']

,ts,event_type,user_id,date_from,date_to,origin,destination,num_adults,num_children
0,2017-04-27 11:06:51,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
731,2017-04-21 18:05:01,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
1387,2017-04-21 19:54:07,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
1445,2017-04-21 18:36:44,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
1832,2017-04-21 18:36:44,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
2200,2017-04-21 18:58:33,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
2908,2017-04-21 18:36:42,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
8658,2017-04-27 11:57:18,book,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
9528,2017-04-27 11:40:39,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1

In [28]:
df_event[df_event['user_id']=='e5d69e']

,ts,event_type,user_id,date_from,date_to,origin,destination,num_adults,num_children
1,2017-04-27 20:15:27,book,e5d69e,2017-08-12,2017-09-02,FRA,WAS,3,1
506,2017-04-27 18:35:15,search,e5d69e,2017-08-12,2017-09-02,FRA,WAS,3,1
5418,2017-04-27 19:06:31,search,e5d69e,2017-08-12,2017-09-02,FRA,WAS,3,1
8662,2017-04-27 20:08:13,search,e5d69e,2017-08-12,2017-09-02,FRA,WAS,3,1
8875,2017-04-27 18:50:46,search,e5d69e,2017-08-12,2017-09-02,FRA,WAS,4,0

In [29]:
df_event[df_event['user_id']=='6600e0']

,ts,event_type,user_id,date_from,date_to,origin,destination,num_adults,num_children
34,2017-04-27 22:39:53,search,6600e0,2017-10-05,2017-10-20,FRA,IST,2,0
152,2017-04-27 22:39:53,search,6600e0,2017-10-05,2017-10-20,FRA,IST,2,0
205,2017-04-27 22:39:52,search,6600e0,2017-10-05,2017-10-20,FRA,IST,2,0
10027,2017-04-27 22:38:03,search,6600e0,2017-10-05,2017-10-20,FRA,IST,2,0

In [30]:
df_event[df_event['user_id']=='dea471']

,ts,event_type,user_id,date_from,date_to,origin,destination,num_adults,num_children
27,2017-04-29 00:24:16,search,dea471,2017-05-05,2017-05-05,MOW,STR,1,0
407,2017-04-29 00:27:16,search,dea471,2017-05-05,2017-05-05,MOW,STR,1,0
4321,2017-04-28 23:45:47,search,dea471,2017-05-05,2017-05-05,MOW,STR,1,0
5035,2017-04-28 23:54:12,search,dea471,2017-05-05,2017-05-05,MOW,STR,1,0
7298,2017-04-28 23:54:05,search,dea471,2017-05-05,2017-05-05,MOW,STR,1,0
8457,2017-04-29 00:00:11,search,dea471,2017-05-05,2017-05-05,MOW,STR,1,0
9586,2017-04-29 00:06:57,search,dea471,2017-05-05,2017-05-05,MOW,STR,1,0

In [33]:
df_event_booked['origin'].value_counts()[:20]

MUC    1179
DUS    1149
FRA    1018
BER     979
HAM     947
PAR     735
STR     601
CGN     515
TXL     196
LYS     130
NCE     102
TLS      98
ZRH      97
ORY      96
CDG      94
MRS      89
BCN      70
AMS      68
SXF      66
IST      52
Name: origin, dtype: int64

In [34]:
df_event_searched['origin'].value_counts()[:20]

PAR    5275
FRA    4795
MUC    3459
DUS    3321
HAM    2752
BER    2522
STR    2083
CGN    1682
LYS    1430
CDG    1212
TLS     887
ORY     870
MRS     807
NCE     619
TXL     494
AMS     382
GVA     372
ZRH     351
BRU     207
BCN     198
Name: origin, dtype: int64

In [38]:
df_event_searched.shape

(37517, 9)

In [ ]:
searched_origin = df_event_searched.groupby('user_id')['origin'].unique().reset_index()

In [ ]:
searched_origin.head(2)